In [26]:
# import libraries
import csv
import pandas as pd
import pickle

In [19]:
# path to csv
csv_path = '/Users/N/Projects/visualizer-for-women/resources/csv/life-expectancy-for-women-at-age-60.csv'

In [8]:
# read csv
'''
l = ''

with open(csv_path, encoding='utf-8-sig') as f:
    reader = csv.reader(f)
    orig_list = [row for row in reader]

l = orig_list

'''

df = pd.read_csv(csv_path, header=0, delimiter=',', na_filter=False)

In [23]:
df_new = pd.concat([df['Location'], df['Value']], axis=1)

df_new

                             Location  Value
0                            Kiribati  14.64
1            Central African Republic  14.85
2                         Afghanistan  15.06
3                             Lesotho  15.24
4    Micronesia (Federated States of)  15.58
..                                ...    ...
727                             Spain  24.82
728                         Australia  24.85
729                            Panama  24.92
730                            France  25.29
731                             Japan  26.59

[732 rows x 2 columns]

In [31]:
# save as json
json_path = csv_path.replace('csv', 'json')
print(json_path)

df_new.to_json(json_path, orient='values')

/Users/N/Projects/visualizer-for-women/resources/json/life-expectancy-for-women-at-age-60.json

In [28]:
# save as txt
txt_path = csv_path.replace('csv', 'txt')
print(txt_path)

f = open(txt_path, 'wb')
l= df_new.values.tolist()
pickle.dump(l, f)

/Users/N/Projects/visualizer-for-women/resources/txt/life-expectancy-for-women-at-age-60.txt